Revit 2024 API
BuiltInFailures.RebarFailures.InvalidRebarHostFamilyCanHostRebarParam Property
 Rebar can't be placed in this Generic Model element because rebar hosting is disabled in the family [Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidRebarHostFamilyCanHostRebarParam { get; }
Visual Basic
Public Shared ReadOnly Property InvalidRebarHostFamilyCanHostRebarParam As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidRebarHostFamilyCanHostRebarParam {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace